# Core
brew "git"
brew "fish"
brew "starship"
brew "tmux"
brew "neovim"

# Search & Navigation
brew "fzf"
brew "fd"
brew "ripgrep"
brew "jump"

# Languages & Runtimes
brew "node"
brew "go"

# Dev Tools
brew "cmake"
brew "ninja"
brew "yamllint"
brew "terraform"
brew "terragrunt"

# Casks
cask "font-fira-code"
cask "claude-code"
